#coding:utf-8
import random
def xingelabel():
    a=random.randint(0,9)
    list_hobby= [
        '你需要别人喜欢你和欣赏你，但你通常对自己要求苛刻。虽然你在个性上有一些弱点，但你通常能够设法加以弥补。你在某些方面的能力并没有得到充分发挥，所以还未能变成你的优势。从外表来看，你是一个讲求自律和自制的人，但内心却常常焦虑不安。有时候，你会强烈怀疑自己是不是做出了正确的决定或正确的事情。你倾向于让自己的生活有所改变和变得丰富多彩，在遇到约束和限制时你会感到不满。你很自豪自己是一个能够独立思考的人，如果没有令人满意的证据，你不会接受别人的观点和说法。不过，你也觉得在别人面前过于直言不讳并不是明智之举，有时候你很外向，比较容易亲近，也乐于与人交往，但有时候你却很内向，比较小心谨慎，而且沉默寡言。你有很多梦想，其中有一些看起来相当不实际。',
        '你是典型的本质消极但外表热情的人，好像总是有所追求。你追求一切让自己的生活过得更好的事物，却又没办法去正视自己天生的悲观和灰暗，所以你会表现得既浮躁急切又愤世嫉俗',
        '你的完美总是表现得过于夸张，有时已经完全脱离真实的生活，上升到外太空、异世界层面。所以你的一生与其说在遐想的完美中度过，不如说在一种绝对的科幻或玄幻状态中度过，你所期望的一切估计只有在科幻或玄幻小说里才能找到并完成吧&oq=你的完美总是表现得过于夸张，有时已经完全脱离真实的生活，上升到外太空、异世界层面。所以你的一生与其说在遐想的完美中度过，不如说在一种绝对的科幻或玄幻状态中度过，你所期望的一切估计只有在科幻或玄幻小说里才能找到并完成吧',
        '你的想法天马行空，不着边际，好奇心和观察力总是天花乱坠，无人能及。别人根本不可能知道你的下一步是什么，下一个问题的答案在哪里。甚至连你自己都不知道做一件事的目的何在，意义在哪。你的人生不是在不停的悬疑中进行，就是在荒诞中落幕',
        '虽然你十分相信自己，但是当你面对陌生的环境时，会变得不够自信。但是你会承认这种情况，因为你有一个坚强的性格。你并不需要投入大量的精力，一般来说你会争取自己想要的',
        '你是很懂得保护自己和观察自己的人，你是向上的积极的，你已经给自己制定好了生活目标，你朝着这样的目标在前进着。抑郁要找上你也是比较困难的，你很难会抑郁，你面对生活的时候不会让自己陷入纠结，你很果断，知道该有什么样的选择，日子过得相对轻松',
        '你经常会有迷茫的感觉，你的抑郁几率是很高的，你的生活看起来并没有那么的顺利。你其实是很害怕压力的人，面对生活的时候你经常会质疑自己。你想要的东西越多，那么你的情绪就变得越是不稳定，这样的日子对你来说是很艰难的，你要注意自己的情绪。'
        '性情温良，重友谊，性格塌实稳重，但有时也比较狡黠。事业心一般，对本职工作能认真对待，但对自己专业以外事物没有太大兴趣，喜欢有规律的工作和生活，不喜欢冒险，家庭观念强，比较善于理财。',
        '爱幻想，思维较感性，以是否与自己投缘为标准来选择朋友。性格显得较孤傲，有时较急躁，有时优柔寡断。事业心较强，喜欢有创造性的工作，不喜欢按常规办事。性格倔强，言语犀利，不善于妥协。崇尚浪漫的爱情，但想法往往不切合实际。金钱欲望一般。',
        '意志力强，头脑冷静，有较强的领导欲，事业心强，不达目的不罢休。外表和善，内心自傲，对有利于自己的人际关系比较看重，有时显得性格急噪，咄咄逼人，得理不饶人，不利于自己时顽强抗争，不轻易认输。思维理性，对爱情和婚姻的看法很现实，对金钱的欲望一般。'
    ]
    return (list_hobby[a])

